Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.HasValue
Check if color entry has associated value.
Returns:
True if entry has a value associated with it, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry)
Compare color entries.
other:
Color entry to compare to.
Returns:
True if color entries are equal, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.Color
Color associated with color entry.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.Value
Value associated with color entry.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor(Autodesk.Revit.DB.Color)
Constructs a color entry with no value assigned.
color:
Color assigned to the entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor(Autodesk.Revit.DB.Color,System.Double)
Constructs a color entry with a specific value assigned.
color:
Color assigned to the entry.
value:
Value assigned to the entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor
Constructs a new AnalysisDisplayColorEntry with default settings.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry
Contains one entry of intermediate colors in color settings for analysis display style.
Since:
2011